ednieuw/ESP32Communications/ESP32Arduino_CommV034/ESP32Arduino_CommV034.ino
//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;
                           #if defined(ARDUINO_NANO_ESP32)
//------------------------------------------------------------------------------              //
// PIN Assigments for Arduino Nano ESP32 (S3)
//------------------------------------------------------------------------------
 
enum DigitalPinAssignments {      // Digital hardware constants ATMEGA 328 ----
 SERRX        = D0,               // Connects to Bluetooth TX
 SERTX        = D1,               // Connects to Bluetooth RX
 encoderPinB  = D2, //5,          // D2 left (labeled CLK on decoder) *** D8 on large PCB !!! no interrupt pin (Use GPIO pin numbering for rotary encoder lib)  
 encoderPinA  = D3, //6,          // D3 right (labeled DT on decoder) on interrupt pin
 clearButton  = D4,               //7,  // D4 switch (labeled SW on decoder)
 IRReceiverPin= D4,               // D4 Infrared receiver pin instead of rotary encoder
 HC12_TX      = D4,               // D4 Send time to HC-12 serial UART 433MHz transnitter/receiver
 LED_PIN      = D5,               //8,  // D5 / GPIO 8 Pin to control colour SK6812/WS2812 LEDs (replace D5 with 8 for NeoPixel lib)
 RST_PIN      = D2,               // D2 / GPIO 5 or D6 Reset pin. Stored in Mem.ResetPin. After reset Mem.ResetPin = RST_PIN
 EmptyD7      = D7,               // D7 Empty
 encoderPinBL = D8,               // D8 *** If large PCB is used change pin D2 to D8 !!
 PCB_LED_D09  = D9,               // D9
 PCB_LED_D10  = D10,              // D10
 secondsPin   = D13               //48, // D13  GPIO48 (#ifdef LED_BUILTIN  #undef LED_BUILTIN #define LED_BUILTIN 48 #endif)
 };
 
enum AnaloguePinAssignments {     // Analogue hardware constants ----
 EmptyA0      = A0,               // Empty
 EmptyA1      = A1,               // Empty
 PhotoCellPin = A2,               // LDR pin
 OneWirePin   = A3,               // OneWirePin
 SDA_pin      = A4,               // SDA pin
 SCL_pin      = A5,               // SCL pin
 EmptyA6      = A6,               // Empty
 EmptyA7      = A7};              // Empty
 
                                  #else

//------------------------------------------------------------------------------              //
// PIN Assigments for ESP32 S3 DevKitC 1
//------------------------------------------------------------------------------  
enum DigitalPinAssignments {
 SERRX        = 44,                // Connects to Bluetooth TX
 SERTX        = 43,                // Connects to Bluetooth RX
 encoderPinB  = 4,                 // rotary CLK
 encoderPinA  = 5,                 // rotary DT
 clearButton  = 6,                 // rotary SW
 RST_PIN      = 4,                 // Reset pin. Stored in Mem.ResetPin. After reset Mem.ResetPin = RST_PIN 
 IRReceiverPin= 6,                 // D4 IR receiver (shared with clearButton)
 HC12_TX      = 17,                // GPIO17 HC-12 433MHz time sender 
 LED_PIN      = 48,                // GPIO48 SK6812/WS2812 LED strip
 PCB_LED_D09  = 10,                // D9
 PCB_LED_D10  = 11,                // D10
 secondsPin   = 99,                // 
 };
 
enum AnaloguePinAssignments {
 EmptyA0      = 10,                // Empty
 EmptyA1      = 11,                // Empty
 PhotoCellPin = 12,                // LDR pin
 OneWirePin   = 13,                // OneWirePin
 SDA_pin      = 8,                 // I2C SDA
 SCL_pin      = 9,                 // I2C SCL
 EmptyA6      = 16,                // Empty
 EmptyA7      = 21};               // Empty
                          #endif //defined(ARDUINO_NANO_ESP32)
//------------------------------------------------------------------------------              //
// LED
//------------------------------------------------------------------------------
const uint32_t  NUM_LEDS = 1;                                                                // The no of LEDs when a SK6812 or WS2812 LED-strip is attached to LED_PIN
#define CLEARLEDSTARTUP 9999
                     #ifdef USEEDSOFTLED
EdSoftLED LEDstrip;                                                                          // Use EdSoftLED 
EdSoftLED LED6812strip = EdSoftLED(NUM_LEDS, LED_PIN, SK6812WGRB);
EdSoftLED LED2812strip = EdSoftLED(NUM_LEDS, LED_PIN, WS2812GRB);
bool UsedEDSOFTLED = true;
                      #else
Adafruit_NeoPixel LEDstrip;
Adafruit_NeoPixel LED6812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRBW + NEO_KHZ800); // NEO_RGBW
Adafruit_NeoPixel LED2812strip = Adafruit_NeoPixel(NUM_LEDS, LED_PIN, NEO_GRB  + NEO_KHZ800); // NEO_RGB NEO_GRB
bool UsedEDSOFTLED = false;
                      #endif
// #define MCULEDPIN 9
// Adafruit_NeoPixel MCUled = Adafruit_NeoPixel(1, MCULEDPIN, NEO_GRB + NEO_KHZ800);  //NEO_RGB NEO_GRB

//------------------------------------------------------------------------------              //
const uint32_t black    = 0x000000, orangered     = 0xFF4000, red        = 0xFF0000, chartreuse   = 0x7FFF00;
const uint32_t brown    = 0x503000, cyberyellow   = 0xFFD300, orange     = 0xFF8000; 
const uint32_t yellow   = 0xFFFF00, cadmiumyellow = 0xFFF600, dyellow    = 0xFFAA00, chromeyellow = 0xFFA700;
const uint32_t green    = 0x00FF00, brightgreen   = 0x66FF00, apple      = 0x80FF00, grass        = 0x00FF80;  
const uint32_t amaranth = 0xE52B50, edamaranth    = 0xFF0050, amber      = 0xFF7E00;
const uint32_t marine   = 0x0080FF, darkviolet    = 0x800080, pink       = 0xFF0080, purple       = 0xFF00FF; 
const uint32_t blue     = 0x0000FF, cerulean      = 0x007BA7, sky        = 0x00FFFF, capri        = 0x00BFFF;
const uint32_t edviolet = 0X7500BC, frenchviolet  = 0X8806CE, coquelicot = 0xFF3800;
const uint32_t greenblue= 0x00F2A0, hotmagenta    = 0xFF00BF, dodgerblue = 0x0073FF, screamingreen= 0x70FF70;
      uint32_t white    = 0xFFFFFF, lgray         = 0x666666, wgray      = 0xAAAAAA;
      uint32_t gray     = 0x333333, dgray         = 0x222222;  

