ednieuw/ESP32Communications/ESP32Arduino_CommV034/ESP32Arduino_CommV034.ino
 const char *menusmall[] = {
 "I Menu, II long menu",
 "K LDR reads/sec toggle On/Off", 
 "N Display off between Nhhhh (N2208)",
 "R Reset settings",
 "U HC12 timesender On/Off",
 "@ Restart" };
//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud
 Wire.begin();                                                                                // Maybe not necessary
 int32_t Tick = millis(); 
 InitStorage();                                                                               // Load settings from storage and check validity   
 Mem.MCUrestarted++;                                                                          // MCU Restart counter     
 if(Mem.MCUrestarted>10) { Reset(); }                                                         // If the MCU restarts during Setup() so often -> Reset() but no ResetCredentials(); 
 StoreStructInFlashMemory();                                                                  // Store the Mem.MCUrestarted   
 StartLeds();                                                                                 // Select the SK6812 or WS2812 LED strip and initialysed
 SetStatusLED(10,0,0);                                                                        // Set the status LED to red
 while (!Serial && ( (millis()-Tick) < 2002)) { LEDstartup(green);delay(500); }               // Wait max 1.5 sec to establish serial connection
 SetStatusLED(10,0,10);                                                                       // Set the status LED to red
 while (!Serial && ( (millis()-Tick) < 3000)) { LEDstartup(purple); delay(250); }             // Wait max 3 sec to establish serial connection
 PrintHeaps(); 
 LEDstartup(capri); Tekstprintln("Serial started\nStored settings loaded\nLED strip started");// InitStorage and StartLEDs must be called first                                                               // 
 Tekstprintlnf( "Using %s LED library", UsedEDSOFTLED?"EDSOFTLED":"NEOPIXEL");                // 
 Tekstprintlnf("LED strip is %s", Mem.LEDstrip?"WS2812":"SK6812" );
 if(Mem.TimeInput==1) {LEDstartup(pink);  InitRotaryMod();     Tekstprintln("Rotary available"); }      // Start the Rotary encoder
 if(Mem.TimeInput==2) {LEDstartup(grass); InitKeypad3x1();     Tekstprintln("Keypad available"); }      // Start the Keypad 3x1 
 if(Mem.TimeInput >2) {LEDstartup(white); Start_IRreceiver();  Tekstprintln("IRremote available");}     // Start IR remote Mem.TimeInput = 3 or 4                                                                                     
 if(Mem.BLEOn)        {LEDstartup(blue);  StartBLEService();   Tekstprintln("BLE started"); }           // Start BLE service 
 if(Mem.WIFIOn)       {LEDstartup(purple);ConnectWIFI();       Tekstprintln("WIFI started");}           // Start WIFI and optional NTP if Mem.WIFIOn = 1 
 InitTimeSystem();     LEDstartup(yellow);                      Tekstprintln("Time system started");     // Initialize RTC + DS3231 sync
 if(Mem.TimeReceiver) {LEDstartup(blue); StartTimeReceiverScan();Tekstprintln("Time Receiver started"); } // Time Sender app on iPhone can be used
 if(Mem.TimeSender)   {LEDstartup(sky);  BLETimeSenderStart(); Tekstprintln("Time Sender started"); }   // Start the TimeSender   
 if(Mem.HC12Time)     {LEDstartup(amber);  InitHC12();           Tekstprintln("HC12 Time started"); }     // Start the HC12 time sender  
 if(Mem.ResetPin)     {LEDstartup(orangered); InitResetpin(); Tekstprintlnf("RST button on GPIO %d started",Mem.ResetPin); } //  
 Previous_LDR_read = ReadLDR();                                                                         // Set the initial LDR reading 
 GetTijd(true);                                                                               // Get the time and do not print it
 LEDstartup(green);                                                                           // Set the status LED to green
 SWversion();                                                                                 // Print the menu + version 
 StoreStructInFlashMemory();                                                                  // 
 delay(50);
 LEDstartup(CLEARLEDSTARTUP);                                                                 // Erase the startup LEDs from the clock display
 Tekstprintln("Setup finished");
    #ifdef ARDUINO_BOARD
 Tekstprint("Compiled on: "); Tekstprintln(ARDUINO_BOARD);
    #endif 
 Tekstprintlnf("Software version: %s", SoftwareName());
 Displaytime(); Tekstprintln("");
 msTick = millis();                                                                           // Start the seconds loop counter
}


//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;                                                                               // a counter to check the speed of the loop
 CheckDevices();                                                                              // Check input from devices
 EverySecondCheck();                                                                          // Enter the command structure
}

//--------------------------------------------                                                //
// COMMON Check connected input devices
//--------------------------------------------
void CheckDevices(void)
{
 CheckBLE();                                                                                  // Something with BLE to do?
 SerialCheck();                                                                               // Check serial port every second
 CheckWIFIcommand();                                                                          // Check if there is a command given from the web page
 if (Mem.TimeReceiver) CheckTimeReceiverClient();                                             // Check if Timesender app is in the air
 if (Mem.TimeInput==1) RotaryEncoderCheck();
 if (Mem.TimeInput==2) Keypad3x1Check();                                                      // 
 if (Mem.TimeInput==3 || Mem.TimeInput==4) IrReceiverDecode();
 if (ntpJustSynced) CheckandPrintNTPsynced();
                                  #ifdef ONEWIREKEYPAD3x4   
 OnewireKeypad3x4Check(); 
                                  #endif  //ONEWIREKEYPAD3x4
                                  #ifdef ONEWIREKEYPAD3x1   
 OnewireKeypad3x1Check(); 
                                  #endif  //ONEWIREKEYPAD3x1
}
//--------------------------------------------                                                //
// COMMON Update routine 
// Performs tasks every second
//--------------------------------------------
void EverySecondCheck(void)
{
 static bool Toggle = 0;
 uint32_t msLeap = millis() - msTick;                                                         // 
 if (msLeap >999)                                                                             // Every second enter the loop
 {
  msTick = millis();
  GetTijd(false);                                                                             // Get the time for the seconds 
  Toggle = !Toggle;                                                                           // Used to turn On or Off Leds
  UpdateStatusLEDs(Toggle);
  if(Mem.ResetPin) CheckResetPin();                                                           // Check  reset button DimLeds(TestLDR);                                                                           // Every second an intensity check and update from LDR reading 
  if (shouldReboot) { delay(2000);   ESP.restart(); }                                         // After finish OTA update restart
  if (timeinfo.tm_min != lastminute) EveryMinuteUpdate();                                     // Enter the every minute routine after one minute; 
  Loopcounter=0;
 }  
}

//--------------------------------------------                                                //
// COMMON Update routine done every minute
//-------------------------------------------- 
void EveryMinuteUpdate(void)
{   
 lastminute = timeinfo.tm_min;  
 if (IR_PowerOnstate && ((millis() - IR_StartTime) > 290000) ) ToggleIRpower();               // Turn off Power after 300 seconds 
 CheckMCURestartCounter();                                                                    // MCUrestarted reset-window. Checks if startup went well
 //GetTijd(false);
 bool ff = NoTextInLeds;                                                                      // flag that controls printing og text in ColorLeds()
 if (Mem.TimeLogPrint == 0 || Mem.TimeLogPrint == 2)                                          // Do not print time but do update the display                                                              // do not Print the time string every minute
    { NoTextInLeds = true; DimLeds(false); Displaytime(); GetTijd(false); }
 if (Mem.TimeLogPrint == 1)                                                                   // Print the time string every minute
    { NoTextInLeds = false; DimLeds(true); Displaytime(); GetTijd(false); }
 DimLeds(false);                                                                              // and DimLEDs are used to print the time every minute
 NoTextInLeds = ff;                                                                           // If Mem.TimeLogPrint == 0 the time (controlled in ColorLeds()
 if(timeinfo.tm_hour != lasthour) EveryHourUpdate(); 
}
//--------------------------------------------                                                //
// COMMON Update routine done every hour
//--------------------------------------------
void EveryHourUpdate(void)
{
 lasthour = timeinfo.tm_hour;
 if (!Mem.StatusLEDOn) SetStatusLED(0,0,0);                                                   // If for some reason the LEDs are ON and after a MCU restart turn them off.  
 if (Mem.TimeLogPrint == 0 )                                                                  // Do not print time but do update the display                                                              // do not Print the time string every minute
    { NoTextInLeds = true; DimLeds(false);  Displaytime();  GetTijd(false);   }
 if (Mem.TimeLogPrint == 2)                                                                   // Print the time string every hour
    { NoTextInLeds = false; DimLeds(true);  Displaytime();  GetTijd(true);  }           
 if ((timeinfo.tm_hour == Mem.TurnOffLEDsAtHH) && (Mem.TurnOffLEDsAtHH != Mem.TurnOnLEDsAtHH))
    { LEDsAreOff = true;  ClearScreen(); }                                                    // Is it time to turn off the LEDs?
 if (timeinfo.tm_hour == Mem.TurnOnLEDsAtHH)
    { LEDsAreOff = false;   lastminute = 99;     Displaytime(); }                             // Force a minute update
 CheckRestoreWIFIconnectivity();                                                              // Check if WIFI is still connected and if not restore it
 Mem.NVRAMmem[lasthour] = NoofLDRreadshour ? (byte)(SumLDRreadshour / NoofLDRreadshour) : 0;  // Update the average LDR readings per hour. Avoids dividing by zero
 SumLDRreadshour  = 0;
 NoofLDRreadshour = 0;
 if (timeinfo.tm_mday != lastday) EveryDayUpdate();  
}
//--------------------------------------------                                                //
// COMMON Update routine done every day
//--------------------------------------------
void EveryDayUpdate(void)
{
 lastday           = timeinfo.tm_mday; 
 Previous_LDR_read = ReadLDR();                                                               // to have a start value and reset the Min Max measurements 
 MinPhotocell      = Previous_LDR_read;                                                       // Stores minimum reading of photocell;
 MaxPhotocell      = Previous_LDR_read;                                                       // Stores maximum reading of photocell;
 Tekstprintln(PrintRTCTime());                                                                // Print time as dd-mmm-yy hh:mm:ss
 StoreStructInFlashMemory();                                                                  // Update Mem struct once a day to store Mem.NVRAM measurementd
}
//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(bool Toggle)
{
 if(Mem.StatusLEDOn)   
   {
    if (Toggle) SetStatusLED(( WiFi.localIP()[0]==0) * 20,                                    // no WIFI on 
                              (WiFi.localIP()[0]!=0) * 20,                                    // WIFI on
                              (BLEConnected)         * 20);                                   // BLE on
    else        SetStatusLED((TRConnected) * 20, (TRConnected) * 20, 0);                      // If TimeRreceiver Connected then Yellow = Red+Green                               
    SetPCBLED09(  Toggle * 10);                                                               // Left LED
    SetPCBLED10((!Toggle) * 10);                                                              // Right LED
    SetNanoLED13((!Toggle) * (!Mem.UseDS3231 * 50));                                          // LED on ESP32 board. IF DS3231 in use then it is off
   }
else                                                                                          // Turn off all LEDs
   {
    SetStatusLED(0,0,0);                  
    SetPCBLED09(0);                                                                           //
    SetPCBLED10(0);                                                                           //
    SetNanoLED13(0);      
   }
}
//--------------------------------------------                                                //
// COMMON Control the RGB LEDs on the Nano ESP32
// Analog range 0 - 512. 0 is LED Off, 512 is max intensity
// 512 is LED off. Therefore the value is subtracted from 512
// in core 3 the value to write is 13-bit 8191 to turn off the led completely
//  rgbLedWrite(512-Red,512-Green,512-Blue);
//--------------------------------------------
void SetStatusLED(int Red, int Green, int Blue)                                               // If LED should be off, use digitalWrite instead of analogWrite
{
 analogWrite(LED_RED,   Red   == 0 ? 8191 : (512 - Red));
 analogWrite(LED_GREEN, Green == 0 ? 8191 : (512 - Green));
 analogWrite(LED_BLUE,  Blue  == 0 ? 8191 : (512 - Blue));
}
//--------------------------------------------                                                //
// COMMON Control orange LED D13 on the Arduino 
//--------------------------------------------
void SetNanoLED13(int intensity) {analogWrite(secondsPin, intensity);}
//--------------------------------------------                                                //
// COMMON Control the RGB LED on the PCB
//--------------------------------------------
void SetPCBLED09(int intensity) {analogWrite(PCB_LED_D09, intensity);}
void SetPCBLED10(int intensity) {analogWrite(PCB_LED_D10, intensity);}

//--------------------------------------------                                                //
// COMMON check for serial input
//--------------------------------------------
void SerialCheck(void)
{
 String SerialString; 
 while (Serial.available())
    { 
     char c = Serial.read();                                                                  // Serial.write(c);
     if (c>31 && c<128) SerialString += c;                                                    // Allow input from Space - Del
     else c = 0;                                                                              // Delete a CR
    }
 if (SerialString.length()>0) 
    {
     ReworkInputString(SerialString);                                                         // Rework ReworkInputString();
     SerialString = "";
    }
}

//--------------------------------------------                                                //
// COMMON Initialyse Resetpin when installed
// Restarting the Arduino 5 times in the hour also resets de settings to default or Rotary press 9 times
//--------------------------------------------
void InitResetpin(void)
{
  if(Mem.ResetPin) pinMode(Mem.ResetPin, INPUT_PULLUP);                                       // Pull RST_PIN pin high if pin >0  
}
//--------------------------------------------
// COMMON  Check reset button on RST_PIN (D6)
// Triggers Reset() and ResetCredentials(); when held LOW for >= 2 seconds.
// Called once per second from EverySecondCheck().
//--------------------------------------------
void CheckResetPin(void)
{
 if(!Mem.ResetPin)  return;                                                                   // if(Mem.ResetPin)==0 then no resetpin
 static uint8_t PressedSeconds = 0;
 if (digitalRead(RST_PIN) == HIGH) {PressedSeconds = 0; return;}                              // Button not pressed
 if (++PressedSeconds >= 2)
  {
   Tekstprintln("Reset pressed. Settings to Factory default. Restarting");   
   Reset();
   ResetCredentials();
   shouldReboot = true;                                                                       // Causes ESP.restart(); 
  }
}

